api-definitions/openapi/examples/ReqPaSendRT.xml

<soapenv:Envelope xmlns:pafn="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <pafn:paSendRTReq>
      <idPA>77777777777</idPA>
      <idBrokerPA>77777777777</idBrokerPA>
      <idStation>77777777777_01</idStation>
      <receipt>
        <receiptId>f43cf6263ddb47248222b039f6d1f1f5</receiptId>
        <noticeNumber>311018351493172600</noticeNumber>
        <fiscalCode>77777777777</fiscalCode>
        <outcome>OK</outcome>
        <creditorReferenceId>11018351493172600</creditorReferenceId>
        <paymentAmount>10.00</paymentAmount>
        <description>test</description>
        <companyName>company</companyName>
        <officeName>office</officeName>
        <debtor>
          <uniqueIdentifier>
            <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
            <entityUniqueIdentifierValue>77777777777</entityUniqueIdentifierValue>
          </uniqueIdentifier>
          <fullName>name</fullName>
          <streetName>street</streetName>
          <civicNumber>99</civicNumber>
          <postalCode>20155</postalCode>
          <city>city</city>
          <stateProvinceRegion>state</stateProvinceRegion>
          <country>IT</country>
          <e-mail>prova@test.it</e-mail>
        </debtor>
        <transferList>
          <transfer>
            <idTransfer>1</idTransfer>
            <transferAmount>10.00</transferAmount>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <IBAN>IT45R0760103200000000001016</IBAN>
            <remittanceInformation>test</remittanceInformation>
            <transferCategory>test</transferCategory>
          </transfer>
        </transferList>
        <idPSP>70000000001</idPSP>
        <pspFiscalCode>CF70000000001</pspFiscalCode>
        <pspPartitaIVA>piva700000000001</pspPartitaIVA>
        <PSPCompanyName>Psp Salvo</PSPCompanyName>
        <idChannel>70000000001_01</idChannel>
        <channelDescription>app</channelDescription>
        <payer>
          <uniqueIdentifier>
            <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
            <entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
          </uniqueIdentifier>
          <fullName>name</fullName>
          <streetName>street</streetName>
          <civicNumber>civic</civicNumber>
          <postalCode>postal</postalCode>
          <city>city</city>
          <stateProvinceRegion>state</stateProvinceRegion>
          <country>IT</country>
          <e-mail>prova@test.it</e-mail>
        </payer>
        <paymentMethod>creditCard</paymentMethod>
        <fee>2.00</fee>
        <paymentDateTime>2021-03-25T17:48:22</paymentDateTime>
        <applicationDate>2021-12-12</applicationDate>
        <transferDate>2021-12-11</transferDate>
        <metadata>
          <mapEntry>
            <key>1</key>
            <value>22</value>
          </mapEntry>
        </metadata>
      </receipt>
    </pafn:paSendRTReq>
  </soapenv:Body>
</soapenv:Envelope>
